1) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:18    [M] FalseValue

--- Original
+++ New
@@ @@
      * @param bool $strict
      * @return bool
      */
-    public function equals(string|array $possibleEnvNames, mixed $possibleEnvValues, bool $strict = FALSE): bool
+    public function equals(string|array $possibleEnvNames, mixed $possibleEnvValues, bool $strict = true): bool
     {
         $envValue = $this->get($possibleEnvNames, NULL, $strict);
         if (is_scalar($possibleEnvValues)) {

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.d0b41f1a025e9f50e1e5779cd06cf73f.infection.xml
  
  F
  
  Time: 00:00.018, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 4, Failures: 1.

2) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:21    [M] IfNegation

--- Original
+++ New
@@ @@
     public function equals(string|array $possibleEnvNames, mixed $possibleEnvValues, bool $strict = FALSE): bool
     {
         $envValue = $this->get($possibleEnvNames, NULL, $strict);
-        if (is_scalar($possibleEnvValues)) {
+        if (!is_scalar($possibleEnvValues)) {
             $possibleEnvValues = [$possibleEnvValues];
         }
         return in_array($envValue, $possibleEnvValues);

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.a7d2944bfac57f2e2f06d7fea6f4b77c.infection.xml
  
  F
  
  Time: 00:00.021, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:21
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

3) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $envValue = $this->get($possibleEnvNames, NULL, $strict);
         if (is_scalar($possibleEnvValues)) {
-            $possibleEnvValues = [$possibleEnvValues];
+            $possibleEnvValues = [];
         }
         return in_array($envValue, $possibleEnvValues);
     }

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.0a3e897b0bfde91906262503caeb3ff2.infection.xml
  
  F
  
  Time: 00:00.021, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToString
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:50
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

4) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:36    [M] FalseValue

--- Original
+++ New
@@ @@
      * @param bool $strict
      * @return mixed
      */
-    public function get(string|array $possibleEnvNames, mixed $default = NULL, bool $strict = FALSE): mixed
+    public function get(string|array $possibleEnvNames, mixed $default = NULL, bool $strict = true): mixed
     {
         if (is_scalar($possibleEnvNames)) {
             $possibleEnvNames = [$possibleEnvNames];

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.9b06a8b3ca5dd71aaf6f11cc4cc4a674.infection.xml
  
  F
  
  Time: 00:00.022, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testGetString
  Failed asserting that null matches expected 'test_value'.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:146
  
  FAILURES!
  Tests: 1, Assertions: 4, Failures: 1.

5) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:37    [M] IfNegation

--- Original
+++ New
@@ @@
      */
     public function get(string|array $possibleEnvNames, mixed $default = NULL, bool $strict = FALSE): mixed
     {
-        if (is_scalar($possibleEnvNames)) {
+        if (!is_scalar($possibleEnvNames)) {
             $possibleEnvNames = [$possibleEnvNames];
         }
         $manipulationFn = $strict ? function (string $key) {

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.89686cf3232132f8c6dae5403cfedd9d.infection.xml
  
  EEF
  
  Time: 00:00.020, Memory: 10.00 MB
  
  There were 2 errors:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToString
  TypeError: Kristos80\EnvReader\EnvReader::Kristos80\EnvReader\{closure}(): Argument #1 ($key) must be of type string, array given, called in /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php on line 46
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:39
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:46
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:20
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:49
  
  2) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  TypeError: Kristos80\EnvReader\EnvReader::Kristos80\EnvReader\{closure}(): Argument #1 ($key) must be of type string, array given, called in /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80

6) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function get(string|array $possibleEnvNames, mixed $default = NULL, bool $strict = FALSE): mixed
     {
         if (is_scalar($possibleEnvNames)) {
-            $possibleEnvNames = [$possibleEnvNames];
+            $possibleEnvNames = [];
         }
         $manipulationFn = $strict ? function (string $key) {
             return $key;

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.69285d41fcd094056ef6aec5cb9262f3.infection.xml
  
  F
  
  Time: 00:00.020, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityStringToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:79
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

7) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:41    [M] Ternary

--- Original
+++ New
@@ @@
             $possibleEnvNames = [$possibleEnvNames];
         }
         $manipulationFn = $strict ? function (string $key) {
+            return strtolower($key);
+        } : function (string $key) {
             return $key;
-        } : function (string $key) {
-            return strtolower($key);
         };
         foreach ($possibleEnvNames as $possibleEnvName) {
             foreach ($_ENV as $envName => $envValue) {

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.e2a160fdb90757e98fbeca50992dae59.infection.xml
  
  F
  
  Time: 00:00.019, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that true is false.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:24
  
  FAILURES!
  Tests: 1, Assertions: 2, Failures: 1.

8) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:44    [M] FunctionCall

--- Original
+++ New
@@ @@
         $manipulationFn = $strict ? function (string $key) {
             return $key;
         } : function (string $key) {
-            return strtolower($key);
+            strtolower($key);
+            return null;
         };
         foreach ($possibleEnvNames as $possibleEnvName) {
             foreach ($_ENV as $envName => $envValue) {

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.2a5f292dcc284344f6e38a856a567c8c.infection.xml
  
  F
  
  Time: 00:00.019, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:27
  
  FAILURES!
  Tests: 1, Assertions: 3, Failures: 1.

9) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:44    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
         $manipulationFn = $strict ? function (string $key) {
             return $key;
         } : function (string $key) {
-            return strtolower($key);
+            return $key;
         };
         foreach ($possibleEnvNames as $possibleEnvName) {
             foreach ($_ENV as $envName => $envValue) {

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.7f7a58503b8cb92642cd2a01182496b1.infection.xml
  
  F
  
  Time: 00:00.020, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:30
  
  FAILURES!
  Tests: 1, Assertions: 4, Failures: 1.

10) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:47    [M] Foreach_

--- Original
+++ New
@@ @@
         } : function (string $key) {
             return strtolower($key);
         };
-        foreach ($possibleEnvNames as $possibleEnvName) {
+        foreach ([] as $possibleEnvName) {
             foreach ($_ENV as $envName => $envValue) {
                 if ($manipulationFn($possibleEnvName) === $manipulationFn($envName)) {
                     return $envValue;

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.b5834971288dedd96a03b110edcdcf0e.infection.xml
  
  F
  
  Time: 00:00.013, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:21
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

11) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:48    [M] Foreach_

--- Original
+++ New
@@ @@
             return strtolower($key);
         };
         foreach ($possibleEnvNames as $possibleEnvName) {
-            foreach ($_ENV as $envName => $envValue) {
+            foreach ([] as $envName => $envValue) {
                 if ($manipulationFn($possibleEnvName) === $manipulationFn($envName)) {
                     return $envValue;
                 }

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.1de6135baa803a9e84dfbce92486b28e.infection.xml
  
  F
  
  Time: 00:00.013, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:21
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.

12) /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/src/EnvReader.php:49    [M] Identical

--- Original
+++ New
@@ @@
         };
         foreach ($possibleEnvNames as $possibleEnvName) {
             foreach ($_ENV as $envName => $envValue) {
-                if ($manipulationFn($possibleEnvName) === $manipulationFn($envName)) {
+                if ($manipulationFn($possibleEnvName) !== $manipulationFn($envName)) {
                     return $envValue;
                 }
             }

  PHPUnit 10.5.17 by Sebastian Bergmann and contributors.
  
  Runtime:       PHP 8.3.8
  Configuration: /private/var/folders/d1/zsqw1bv52jvchdt7wdkn951r0000gp/T/infection/phpunitConfiguration.418ba8208d3eabe767adf2f9bafa5a7b.infection.xml
  
  F
  
  Time: 00:00.018, Memory: 10.00 MB
  
  There was 1 failure:
  
  1) Kristos80\EnvReader\Tests\Unit\EnvReaderTest::testEqualityArrayToArray
  Failed asserting that false is true.
  
  /Users/chrisathanasiadis/Documents/www/herd/kiko-2/kristos80/env-reader/tests/Unit/EnvReaderTest.php:21
  
  FAILURES!
  Tests: 1, Assertions: 1, Failures: 1.
